<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/Logo blue_dark.png"  style="width:25px" align="right";/>
</div>

# SQL Exam

© ExploreAI Academy

## Instructions to students

This challenge is designed to determine how much you have learned so far and will test your knowledge on SQL.

The answers for this challenge should be selected on Athena for each corresponding multiple-choice question. The questions are included in this notebook and are numbered according to the Athena questions. The options for each question have also been included.

Do not add or remove cells in this notebook. Do not edit or remove the `%%sql` comment as it is required to run each cell.

**_Good luck!_**

## Honour code

I,Abdelrahman Mohamed, confirm – by submitting this document – that the solutions in this notebook are a result of my own work and that I abide by the EDSA honour code (https://drive.google.com/file/d/1QDCjGZJ8-FmJE3bZdIQNwnJyQKPhHZBn/view?usp=sharing).

Non-compliance with the honour code constitutes a material breach of contract.

## The TMDb database

In this supplementary exam, you will be exploring [The Movie Database](https://www.themoviedb.org/) – an online movie and TV show database that houses some of the most popular movies and TV shows at your fingertips. The TMDb database supports 39 official languages used in over 180 countries daily and dates back all the way to 2008.

<img src="https://github.com/Explore-AI/Pictures/blob/master/sql_tmdb.jpg?raw=true" width=80%/>

Below is an Entity Relationship Diagram (ERD) of the TMDb database:

<img src="https://github.com/Explore-AI/Pictures/blob/master/TMDB_ER_diagram.png?raw=true" width=70%/>

As can be seen from the ERD, the TMDb database consists of `12 tables` containing information about movies, cast, genre, and so much more.

Let's get started!

## Loading the database

Before you begin, you need to prepare your SQL environment. You can do this by loading the magic command `%load_ext sql`.

In [5]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook. 
# If you get an error here, make sure that mysql and pymysql are installed correctly. 

%load_ext sql

Next, go ahead and load your database. To do this, you will need to ensure you have downloaded the `TMDB.db` sqlite file from Athena and have stored it in a known location.

In [7]:
# Establish a connection to the local database using the '%sql' magic command.
# Replace 'password' with our connection password and `db_name` with our database name. 
# If you get an error here, please make sure the database name or password is correct.

%sql sqlite:///TMDB-a-4006.db

'Connected: @TMDB-a-4006.db'

If the above line didn't throw out any errors, then you should be good to go. Good luck with the exam!

In [2]:
from sqlalchemy import create_engine

# Replace 'your_database_url' with the actual connection URL for your database
engine = create_engine('sqlite:///TMDB-a-4006.db')

# Get the database name from the connection URL
database_name = engine.url.database

# Display the database name
print(f"The database name is: {database_name}")

The database name is: TMDB-a-4006.db

In [3]:
from sqlalchemy import create_engine, MetaData

# Replace 'your_database_url' with the actual connection URL for your database
engine = create_engine('sqlite:///TMDB-a-4006.db')

# Create a MetaData object
metadata = MetaData()

# Reflect all tables from the database
metadata.reflect(bind=engine)

# Get the list of table names
table_names = metadata.tables.keys()

# Display the table names
print("Tables in the database:")
for table_name in table_names:
    print(table_name)

Tables in the database:
actors
casts
movies
genremap
genres
keywordmap
keywords
languagemap
languages
oscars
productioncompanies
productioncompanymap
productioncountries
productioncountrymap
sysdiagrams

## Questions on SQL

Use the given cell below each question to execute your SQL queries to find the correct input from the options provided. Your solution should match one of the multiple-choice questions on Athena.

### Question 1

Who won the Oscar for “Actor in a Leading Role” in 2015?

(Hint: The winner is indicated as '1.0'.)

**Options:**

- Micheal Fassbender
- Natalie Portman
- Leonardo DiCaprio
- Eddie Redmayne

In [15]:
%%sql

SELECT 
    *
FROM
    oscars
WHERE
    year = 2015
AND 
    award = 'Actor in a Leading Role'
AND 
    winner = 1.0
limit 10

 * sqlite:///TMDB-a-4006.db
Done.

[('2015', 'Actor in a Leading Role', '1.0', 'Leonardo DiCaprio', 'The Revenant')]

### Question 2

What query will produce the ten oldest movies in the database?

**Options:**

- SELECT TOP(10) \* FROM movies WHERE release_date ORDER BY release_date ASC

- SELECT \* FROM movies WHERE release_date IS NOT NULL ORDER BY release_date ASC LIMIT 10 -- correct Answer

- SELECT \* FROM movies WHERE release_date IS NOT NULL ORDER BY release_date DESC LIMIT 10

- SELECT \* FROM movies WHERE release_date IS NULL ORDER BY release_date DESC LIMIT 10

In [25]:
%%sql

SELECT * FROM movies WHERE release_date IS NOT NULL ORDER BY release_date ASC LIMIT 10

 * sqlite:///TMDB-a-4006.db
Done.

[(3059, 'Intolerance', '1916-09-04 00:00:00.000000', 385907, None, 'en', 'Intolerance', 'The story of a poor young woman, separated by prejudice from her husband and baby, is interwoven with tales of intolerance from throughout history.', 3.232447, 8394751.0, 197.0, 'Released', 'The Cruel Hand of Intolerance', 7.4, 60),
 (3060, 'The Big Parade', '1925-11-05 00:00:00.000000', 245000, None, 'en', 'The Big Parade', "The story of an idle rich boy who joins the US Army's Rainbow Division and is sent to France to fight in World War I, becomes friends with two working class men, experiences the horrors of trench warfare, and finds love with a French girl.", 0.785744, 22000000.0, 151.0, 'Released', None, 7.0, 21),
 (19, 'Metropolis', '1927-01-10 00:00:00.000000', 92620000, None, 'de', 'Metropolis', "In a futuristic city sharply divided between the working class and the city planners, the son of the city's mastermind falls in love with a working class prophet who predicts the coming of a savior to mediate their differences.", 32.351527, 650422.0, 153.0, 'Released', 'There can be no understanding between the hands and the brain unless the heart acts as mediator.', 8.0, 657),
 (905, "Pandora's Box", '1929-01-30 00:00:00.000000', 0, None, 'de', 'Die Bnchse der Pandora', 'The rise and inevitable fall of an amoral but naive young woman whose insouciant eroticism inspires lust and violence in those around her.', 1.824184, 0.0, 109.0, 'Released', None, 7.6, 45),
 (65203, 'The Broadway Melody', '1929-02-08 00:00:00.000000', 379000, None, 'en', 'The Broadway Melody', "Harriet and Queenie Mahoney, a vaudeville act, come to Broadway, where their friend Eddie Kerns needs them for his number in one of Francis Zanfield' ... (195 characters truncated) ... eenie recognizes, that she is for Jock nothing more than a toy, and it also takes a while till Harriet recognizes, that Eddie is in love with Queenie", 0.968865, 4358000.0, 100.0, 'Released', "The pulsating drama of Broadway's bared heart speaks and sings with a voice to stir your soul!", 5.0, 19),
 (22301, "Hell's Angels", '1930-11-15 00:00:00.000000', 3950000, None, 'en', "Hell's Angels", "Two brothers attending Oxford enlist with the Royal Flying Corps when World War I breaks out. Roy and Monte Rutledge have very different personalitie ... (576 characters truncated) ... t a strategic German munitions facility is a booming success, but with a squadron of fighters bearing down on them afterwards, escape seems unlikely.", 8.484123, 8000000.0, 127.0, 'Released', "Howard Hughes' Thrilling Multi-Million Dollar Air Spectacle", 6.1, 19),
 (22649, 'A Farewell to Arms', '1932-12-08 00:00:00.000000', 4, None, 'en', 'A Farewell to Arms', "British nurse Catherine Barkley (Helen Hayes) and American Lieutenant Frederic Henry (Gary Cooper) fall in love during the First World War in Italy.  ... (105 characters truncated) ... the war rages on. Academy Awards winner for Best Cinematography and for Best Sound, Recording. Nominated for Best Picture and for Best Art Direction.", 1.199451, 25.0, 89.0, 'Released', 'Every woman who has loved will understand', 6.2, 28),
 (3062, '42nd Street', '1933-02-02 00:00:00.000000', 439000, None, 'en', '42nd Street', 'A producer puts on what may be his last Broadway show, and at the last moment a chorus girl has to replace the star.', 1.933366, 2281000.0, 89.0, 'Released', None, 6.1, 37),
 (43595, 'She Done Him Wrong', '1933-02-09 00:00:00.000000', 200000, None, 'en', 'She Done Him Wrong', '"New York singer and nightclub owner Lady Lou has more men friends than you can imagine. Unfortunately one of them is a vicious criminal who\'s escap ... (52 characters truncated) ... ing she hasn\'t exactly been faithful in his absence. Help is at hand in the form of young Captain Cummings a local temperance league leader though."', 0.622752, 2200000.0, 66.0, 'Released', "Mae West gives a 'Hot Time' to the nation!", 5.1, 27),
 (3078, 'It Happened One Night', '1934-02-22 00:00:00.000000', 325000, None, 'en', 'It Happened One Night', "Ellie Andrews has just tied the knot with society aviator King Westley when she is whisked away to her father's yacht and out of King's clutches. Ell ... (233 characters truncated) ... ts her back to her husband, or he'll blow the whistle on Ellie to her father. Either way, Peter gets what he wants... a really juicy newspaper story!", 11.871424, 4500000.0, 105.0, 'Released', 'TOGETHER... for the first time', 7.7, 275)]

### Question 3

How many unique awards are there in the Oscars table?

**Options:**

- 141
- 53
- 80
- 114

In [31]:
%%sql

SELECT 
    count(DISTINCT award)
FROM
    oscars

 * sqlite:///TMDB-a-4006.db
Done.

[(114,)]

### Question 4

How many movies are there that contain the word “Spider” within their title?

**Options:**

- 0
- 5
- 1
- 9

In [37]:
%%sql
SELECT 
    title
FROM
    movies
WHERE
    title LIKE  '%Spider%'

--ANSWER = 9

 * sqlite:///TMDB-a-4006.db
Done.

[('Spider-Man',),
 ('Spider-Man 2',),
 ('Spider-Man 3',),
 ('The Amazing Spider-Man',),
 ('Along Came a Spider',),
 ('The Spiderwick Chronicles',),
 ('Spider',),
 ('Kingdom of the Spiders',),
 ('The Amazing Spider-Man 2',)]

### Question 5

How many movies are there that are both in the "Thriller" genre and contain the word “love” anywhere in the keywords?

**Options:**

- 48
- 38
- 14
- 1 --> corect answer

In [44]:
%%sql

SELECT 
    *
FROM
    genres
WHERE
    genre_name = 'Thriller'

 * sqlite:///TMDB-a-4006.db
Done.

[(53, 'Thriller')]

### Question 6

How many movies are there that were released between 1 August 2006 ('2006-08-01') and 1 October 2009 ('2009-10-01') that have a popularity score of more than 40 and a budget of less than 50 000 000?

**Options:**

- 29 --> corect answer
- 23
- 28
- 35

In [50]:
%%sql
SELECT COUNT(*) AS movie_count
FROM movies
WHERE release_date BETWEEN '2006-08-01' AND '2009-10-01'
  AND popularity > 40
  AND budget < 50000000;

 * sqlite:///TMDB-a-4006.db
Done.

[(29,)]

### Question 7

How many unique characters has "Vin Diesel" played so far in the database?

**Options:**

- 24
- 19
- 18
- 16 --> corect answer

 * sqlite:///TMDB-a-4006.db
Done.

[(5, 62, 'Leo'),
 (5, 138, 'Chester Rush'),
 (5, 2545, 'Long Hair Yuppy Scum'),
 (5, 2555, 'Siegfried'),
 (5, 3122, 'Jezebel'),
 (5, 3123, 'Diana'),
 (5, 3124, 'Athena'),
 (5, 3125, 'Elspeth'),
 (5, 3126, 'Eva'),
 (5, 3127, 'Raven')]

In [67]:
%%sql

SELECT 
    count(DISTINCT cs.characters)
FROM
    actors as ac
JOIN 
    casts as cs
ON
    ac.actor_id = cs.actor_id

WHERE
    actor_name = 'Vin Diesel'

 * sqlite:///TMDB-a-4006.db

Done.

[(16,)]

In [61]:
%%sql
SELECT 
    *
FROM
    casts
LIMIT 10

 * sqlite:///TMDB-a-4006.db
Done.

[(5, 62, 'Leo'),
 (5, 138, 'Chester Rush'),
 (5, 2545, 'Long Hair Yuppy Scum'),
 (5, 2555, 'Siegfried'),
 (5, 3122, 'Jezebel'),
 (5, 3123, 'Diana'),
 (5, 3124, 'Athena'),
 (5, 3125, 'Elspeth'),
 (5, 3126, 'Eva'),
 (5, 3127, 'Raven')]

### Question 8

What are the genres of the movie “The Royal Tenenbaums”?

**Options:**

- Action, Romance
- Drama, Comedy --> Corect Answer
- Crime, Thriller
- Drama, Romance

In [76]:
%%sql

SELECT 
    mo.movie_id,
    gm.genre_id,
    g.genre_name
FROM
    movies as mo
JOIN
    genremap as gm
ON
    mo.movie_id = gm.movie_id
JOIN
    genres as g
ON
    gm.genre_id = g.genre_id

WHERE
    title = 'The Royal Tenenbaums'

 * sqlite:///TMDB-a-4006.db
Done.

[(9428, 18, 'Drama'), (9428, 35, 'Comedy')]

In [70]:
%%sql

SELECT 
    *
FROM
    genremap
LIMIT 3

 * sqlite:///TMDB-a-4006.db
Done.

[(11, 12), (18, 12), (22, 12)]

In [68]:
%%sql

SELECT 
    *
FROM
    genres

 * sqlite:///TMDB-a-4006.db
Done.

[(12, 'Adventure'),
 (14, 'Fantasy'),
 (16, 'Animation'),
 (18, 'Drama'),
 (27, 'Horror'),
 (28, 'Action'),
 (35, 'Comedy'),
 (36, 'History'),
 (37, 'Western'),
 (53, 'Thriller'),
 (80, 'Crime'),
 (99, 'Documentary'),
 (878, 'Science Fiction'),
 (9648, 'Mystery'),
 (10402, 'Music'),
 (10749, 'Romance'),
 (10751, 'Family'),
 (10752, 'War'),
 (10769, 'Foreign'),
 (10770, 'TV Movie')]

### Question 9

What are the three production companies that have the highest movie popularity score on average, as recorded within the database?

**Options:**

- MCL Films S.A., Turner Pictures, and George Stevens Productions
- The Donners' Company, Bulletproof Cupid, and Kinberg Genre -->corect answer
- Bulletproof Cupid, The Donners' Company, and MCL Films S.A
- B.Sting Entertainment, Illumination Pictures, and Aztec Musique

In [100]:
%%sql
SELECT 
    AVG(m.popularity) AS avg_popularity,
    pc.production_company_id,
    pc.production_company_name
FROM
    movies m 
JOIN 
    productioncompanymap mp
ON
    m.movie_id = mp.movie_id
JOIN
    productioncompanies pc
ON
    mp.production_company_id = pc.production_company_id
GROUP BY
    pc.production_company_id
ORDER BY
    avg_popularity DESC
LIMIT 3;

 * sqlite:///TMDB-a-4006.db
Done.

[(514.569956, 11307, "The Donners' Company"),
 (481.098624, 54850, 'Bulletproof Cupid'),
 (326.92099900000005, 78091, 'Kinberg Genre')]

In [98]:
%%sql

SELECT 
    m.popularity,
    mp.production_company_id,
    pc.production_company_name
FROM
    movies m 
JOIN 
    productioncompanymap mp
ON
    m.movie_id = mp.movie_id
JOIN
    productioncompanies pc
ON
    mp.production_company_id = pc.production_company_id
ORDER By
    popularity DESC 
limit 3

 * sqlite:///TMDB-a-4006.db
Done.

[(875.581305, 33, 'Universal Pictures'),
 (875.581305, 6704, 'Illumination Entertainment'),
 (724.247784, 4, 'Paramount Pictures')]

In [96]:
%%sql

SELECT 
    *
FROM
    movies m 

ORDER By
    popularity DESC 
limit 3

 * sqlite:///TMDB-a-4006.db
Done.

[(211672, 'Minions', '2015-06-17 00:00:00.000000', 74000000, 'http://www.minionsmovie.com/', 'en', 'Minions', 'Minions Stuart, Kevin and Bob are recruited by Scarlet Overkill, a super-villain who, alongside her inventor husband Herb, hatches a plot to take over the world.', 875.581305, 1156730962.0, 91.0, 'Released', 'Before Gru, they had a history of bad bosses', 6.4, 4571),
 (157336, 'Interstellar', '2014-11-05 00:00:00.000000', 165000000, 'http://www.interstellarmovie.net/', 'en', 'Interstellar', 'Interstellar chronicles the adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.', 724.247784, 675120017.0, 169.0, 'Released', 'Mankind was born on Earth. It was never meant to die here.', 8.1, 10867),
 (293660, 'Deadpool', '2016-02-09 00:00:00.000000', 58000000, 'http://www.foxmovies.com/movies/deadpool', 'en', 'Deadpool', 'Deadpool tells the origin story of former Special Forces operative turned mercenary Wade Wilson, who after being subjected to a rogue experiment that ... (50 characters truncated) ... s the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life.', 514.569956, 783112979.0, 108.0, 'Released', 'Witness the beginning of a happy ending', 7.4, 10995)]

In [87]:
%%sql
SELECT 
    *
FROM
    productioncompanymap
limit 5

 * sqlite:///TMDB-a-4006.db
Done.

[(11, 1), (85, 1), (87, 1), (89, 1), (217, 1)]

In [91]:
%%sql
SELECT 
    *
FROM
    productioncompanies
limit 5

 * sqlite:///TMDB-a-4006.db
Done.

[(1, 'Lucasfilm'),
 (2, 'Walt Disney Pictures'),
 (3, 'Pixar Animation Studios'),
 (4, 'Paramount Pictures'),
 (5, 'Columbia Pictures')]

### Question 10

How many female actors (i.e. gender = 1) have a name that starts with the letter "N"?

**Options:**

- 0
- 355 --> CORRECT ANSWER
- 7335
- 1949

In [106]:
%%sql
SELECT 
    COUNT(actor_name)
FROM 
    actors
WHERE
    gender = 1
AND    
    actor_name LIKE 'N%'

 * sqlite:///TMDB-a-4006.db
Done.

[(355,)]

### Question 11

Which genre has, on average, the lowest movie popularity score?

**Options:**

- Science Fiction
- Animation
- Documentary
- Foreign --> CORECT ANSWER

In [119]:
%%sql

SELECT 
    AVG(mo.popularity) as pop,
    gm.genre_id,
    g.genre_name
FROM
    movies as mo
JOIN
    genremap as gm
ON
    mo.movie_id = gm.movie_id
JOIN
    genres as g
ON
    gm.genre_id = g.genre_id
GROUP By
    g.genre_name

ORDER By
    pop

 * sqlite:///TMDB-a-4006.db
Done.

[(0.686786794117647, 10769, 'Foreign'),
 (3.945723809090908, 99, 'Documentary'),
 (6.389414749999999, 10770, 'TV Movie'),
 (13.101512475675676, 10402, 'Music'),
 (15.962426457494416, 10749, 'Romance'),
 (17.444838720812175, 36, 'History'),
 (17.764853371789304, 18, 'Drama'),
 (18.221000988966285, 35, 'Comedy'),
 (18.23627854878048, 37, 'Western'),
 (18.295915104046244, 27, 'Horror'),
 (22.85327434051726, 80, 'Crime'),
 (23.777288569444423, 10752, 'War'),
 (24.460076525117703, 53, 'Thriller'),
 (24.58682736494254, 9648, 'Mystery'),
 (27.832848912280713, 10751, 'Family'),
 (30.94038215337952, 28, 'Action'),
 (36.38704340094338, 14, 'Fantasy'),
 (36.45180587102805, 878, 'Science Fiction'),
 (38.81343931196578, 16, 'Animation'),
 (39.26804199113923, 12, 'Adventure')]

In [109]:
%%sql

SELECT 
    *
FROM
    movies
ORDER By
    popularity 
limit 3

 * sqlite:///TMDB-a-4006.db
Done.

[(380097, 'America Is Still the Place', None, 0, None, 'en', 'America Is Still the Place', '"1971 post civil rights San Francisco seemed like the perfect place for a black Korean War veteran and his family to realize their dream of economic  ... (222 characters truncated) ... pened a door that had never been open to a black man before. This is a story about what happened when he stepped through that door, with both feet!."', 0.0, 0.0, 0.0, 'Released', None, 0.0, 0),
 (77156, 'Alien Zone', '1978-11-22 00:00:00.000000', 0, None, 'en', 'Alien Zone', 'A man who is having an affair with a married woman is dropped off on the wrong street when going back to his hotel. He takes refuge out of the rain w ... (25 characters truncated) ... m in. He turns out to be a mortician, who tells him the stories of the people who have wound up in his establishment over the course of four stories.', 0.000372, 0.0, 90.0, 'Released', "Don't you dare go in there!", 4.0, 3),
 (65448, 'Penitentiary', '1979-12-01 00:00:00.000000', 0, None, 'en', 'Penitentiary', "A hitchhiker named Martel Gordone gets in a fight with two bikers over a prostitute, and one of the bikers is killed. Gordone is arrested and sent to ... (2 characters truncated) ... rison, where he joins the prison's boxing team in an effort to secure an early parole and to establish his dominance over the prison's toughest gang.", 0.001117, 0.0, 99.0, 'Released', "There's only one way out, and 100 fools stand in the way!", 4.9, 8)]

In [113]:
%%sql

SELECT 
    *
FROM
    genremap

LIMIT 3

 * sqlite:///TMDB-a-4006.db
Done.

[(11, 12), (18, 12), (22, 12)]

In [112]:
%%sql

SELECT 
    *
FROM
    genres

LIMIT 3

 * sqlite:///TMDB-a-4006.db
Done.

[(12, 'Adventure'), (14, 'Fantasy'), (16, 'Animation')]

In [ ]:
%%sql

### Question 12

Which award category has the highest number of actor nominations (actors can be male or female)? (Hint: `Oscars.name` contains both actors' names and film names.)

**Options:**

- Special Achievement Award
- Actor in a Supporting Role --> CORECT ANSWER
- Actress in a Supporting Role
- Best Picture

In [134]:
# %%sql

# SELECT
#     *
# FROM
#     oscars

# WHERE
#     award = 'Best Picture'

In [140]:
%%sql

SELECT 
    award,
    COUNT(name) as coun
FROM
    oscars

GROUP BY
    award

ORDER by coun DESC

limit 5

 * sqlite:///TMDB-a-4006.db
Done.

[('Directing', 429),
 ('Film Editing', 410),
 ('Actress in a Supporting Role', 400),
 ('Actor in a Supporting Role', 400),
 ('Documentary (Short Subject)', 348)]

In [129]:
%%sql
SELECT 
    award,
    COUNT(*) AS nomination_count
FROM
    Oscars
WHERE
    name IS NOT NULL  -- Exclude records with NULL names (film names)
GROUP BY
    award
ORDER BY
    nomination_count DESC
LIMIT 1;

 * sqlite:///TMDB-a-4006.db
Done.

[('Directing', 429)]

### Question 13

For all of the entries in the Oscars table before 1934, the year is stored differently than in all the subsequent years. For example, the year would be saved as “1932/1933” instead of just “1933” (the second indicated year). Which of the following options would be the appropriate code to update this column to have the format of the year be consistent throughout the entire table (second indicated year only shown)?

**Options:**

- `UPDATE Oscars SET year = RIGHT(year, -4)`
- `UPDATE Oscars SET year = SELECT substr(year, -4)`
- `UPDATE Oscars SET year = substr(year, -4)` -->corect answer
- `UPDATE Oscars year =  substr(year, 4)`

In [146]:
%%sql
SELECT 
    substr(year, -4)
FROM
    oscars
WHERE 
    year < 1934

 * sqlite:///TMDB-a-4006.db
Done.

[('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1928',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1929',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1930',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1931',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1932',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',),
 ('1933',)]

### Question 14

DStv will be having a special week dedicated to the actor Alan Rickman. Which of the following queries would create a new _view_ that shows the titles, release dates, taglines, and overviews of all movies that Alan Rickman has played in?

**Options:**

- SELECT title, release_date, tagline, overview
  FROM Movies LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id Left JOIN Actors ON Casts.actor_id = Actors.actor_id
  WHERE Actors.actor_name = 'Alan Rickman'
  AS VIEW Alan_Rickman_Movies

- CREATE VIEW Alan_Rickman_Movies AS  
  SELECT title, release_date, tagline, overview FROM Movies  
  LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id Left JOIN Actors
  ON Casts.actor_id = Actors.actor_id
  WHERE Actors.actor_name = 'Alan Rickman' -->CORECT ANSWER

- CREATE NEW VIEW Name = Alan_Rickman_Movies AS SELECT title, release_date, tagline, overview FROM Movies LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id Left JOIN Actors ON Casts.actor_id = Actors.actor_id WHERE Actors.actor_name = 'Alan Rickman'

- VIEW Alan_Rickman_Movies AS SELECT title, release_date, tagline, overview FROM Movies LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id Left JOIN Actors ON Casts.actor_id = Actors.actor_id WHERE Actors.actor_name = 'Alan Rickman'

In [147]:
%%sql
CREATE VIEW Alan_Rickman_Movies AS
SELECT title, release_date, tagline, overview
FROM Movies
LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id
LEFT JOIN Actors ON Casts.actor_id = Actors.actor_id
WHERE Actors.actor_name = 'Alan Rickman';

 * sqlite:///TMDB-a-4006.db
(sqlite3.OperationalError) view Alan_Rickman_Movies already exists
[SQL: CREATE VIEW Alan_Rickman_Movies AS
SELECT title, release_date, tagline, overview
FROM Movies
LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id
LEFT JOIN Actors ON Casts.actor_id = Actors.actor_id
WHERE Actors.actor_name = 'Alan Rickman';]
(Background on this error at: http://sqlalche.me/e/14/e3q8)

In [148]:
%%sql

SELECT 
    *
FROM
    Alan_Rickman_Movies

 * sqlite:///TMDB-a-4006.db
Done.

[('Love Actually', '2003-09-07 00:00:00.000000', 'The ultimate romantic comedy.', 'Follows seemingly unrelated people as their lives begin to intertwine while they fall in û and out û of love. Affections languish and develop as Christmas draws near.'),
 ('Die Hard', '1988-07-15 00:00:00.000000', '40 Stories. Twelve Terrorists. One Cop.', "NYPD cop, John McClane's plan to reconcile with his estranged wife is thrown for a serious loop when minutes after he arrives at her office, the enti ... (31 characters truncated) ... roup of terrorists. With little help from the LAPD, wisecracking McClane sets out to single-handedly rescue the hostages and bring the bad guys down."),
 ("Harry Potter and the Philosopher's Stone", '2001-11-16 00:00:00.000000', 'Let the Magic Begin.', "Harry Potter has lived under the stairs at his aunt and uncle's house his whole life. But on his 11th birthday, he learns he's a powerful wizard -- w ... (114 characters truncated) ... d powers with the help of the school's kindly headmaster, Harry uncovers the truth about his parents' deaths -- and about the villain who's to blame."),
 ('Harry Potter and the Chamber of Secrets', '2002-11-13 00:00:00.000000', 'Hogwarts is back in session.', 'Ignoring threats to his life, Harry returns to Hogwarts to investigate û aided by Ron and Hermione û a mysterious series of attacks.'),
 ('Harry Potter and the Prisoner of Azkaban', '2004-05-31 00:00:00.000000', 'Something wicked this way comes.', 'Harry, Ron and Hermione return to Hogwarts for another magic-filled year. Harry comes face to face with danger yet again, this time in the form of escaped convict, Sirius Black û and turns to sympathetic Professor Lupin for help.'),
 ('Harry Potter and the Goblet of Fire', '2005-11-05 00:00:00.000000', 'Dark And Difficult Times Lie Ahead.', 'Harry starts his fourth year at Hogwarts, competes in the treacherous Triwizard Tournament and faces the evil Lord Voldemort. Ron and Hermione help Harry manage the pressure û but Voldemort lurks, awaiting his chance to destroy Harry and all that he stands for.'),
 ('Harry Potter and the Order of the Phoenix', '2007-06-28 00:00:00.000000', 'Evil Must Be Confronted.', "Returning for his fifth year of study at Hogwarts, Harry is stunned to find that his warnings about the return of Lord Voldemort have been ignored. L ... (20 characters truncated) ... Harry takes matters into his own hands, training a small group of students û dubbed 'Dumbledore's Army' û to defend themselves against the dark arts."),
 ('Harry Potter and the Half-Blood Prince', '2009-07-07 00:00:00.000000', 'Dark Secrets Revealed', "As Harry begins his sixth year at Hogwarts, he discovers an old book marked as 'Property of the Half-Blood Prince', and begins to learn more about Lord Voldemort's dark past."),
 ('Galaxy Quest', '1999-12-23 00:00:00.000000', 'A comedy of Galactic Proportions.', "The stars of a 1970s sci-fi show - now scraping a living through re-runs and sci-fi conventions - are beamed aboard an alien spacecraft. Believing th ... (64 characters truncated) ... l-life adventures, the band of aliens turn to the ailing celebrities for help in their quest to overcome the oppressive regime in their solar system."),
 ('Perfume: The Story of a Murderer', '2006-09-13 00:00:00.000000', 'Based on the best-selling novel', "Jean-Baptiste Grenouille, born in the stench of 18th century Paris, develops a superior olfactory sense, which he uses to create the world's finest perfumes. However, his work takes a dark turn as he tries to preserve scents in the search for the ultimate perfume."),
 ('Michael Collins', '1996-10-25 00:00:00.000000', "Ireland, 1916. His Dreams Inspired Hope. His Words Ignited Passion. His Courage Forged A Nation's Destiny.", 'Michael Collins plays a crucial role in the establishment of the Irish Free State in the 1920s, but becomes vilified by those hoping to create a completely independent Irish republic.'),
 ('Dogma', '1999-11-12 00:00:00.000000', 'It can be Hell getting into Heaven', 'The latest battle in the eternal war between Good and Evil has come to New Jersey in the late, late 20th Century. Angels, demons, apostles and prophets (of a sort) walk among the cynics and innocents of America and duke it out for the fate of humankind.'),
 ('Sense and Sensibility', '1995-12-13 00:00:00.000000', 'Lose your heart and come to your senses.', 'Rich Mr. Dashwood dies, leaving his second wife and her daughters poor by the rules of inheritance. Two daughters are the titular opposites.'),
 ("The Hitchhiker's Guide to the Galaxy", '2005-01-15 00:00:00.000000', "Don't leave Earth without it.", '"Mere seconds before the Earth is to be demolished by an alien construction crew, Arthur Dent is swept off the planet by his friend Ford Prefect, a researcher penning a new edition of ""The Hitchhiker\'s Guide to the Galaxy."""'),
 ('Robin Hood: Prince of Thieves', '1991-06-14 00:00:00.000000', 'For the good of all men, and the love of one woman, he fought to uphold justice by breaking the law.', "When the dastardly Sheriff of Nottingham murders Robin's father, the legendary archer vows vengeance. To accomplish his mission, Robin joins forces with a band of exiled villagers (and comely Maid Marian), and together they battle to end the evil sheriff's reign of terror."),
 ('Quigley Down Under', '1990-10-17 00:00:00.000000', "There's a price on his head. A girl on his mind. And a twinkle in his eye.", "American Matt Quigley answers Australian land baron Elliott Marston's ad for a sharpshooter to kill the dingoes on his property. But when Quigley fin ... (45 characters truncated) ... igines, Quigley hits the road. Now, even American expatriate Crazy Cora can't keep Quigley safe in his cat-and-mouse game with the homicidal Marston."),
 ('Alice in Wonderland', '2010-03-03 00:00:00.000000', "You're invited to a very important date.", "Alice, an unpretentious and individual 19-year-old, is betrothed to a dunce of an English nobleman. At her engagement party, she escapes the crowd to ... (328 characters truncated) ... ous bandersnatches. Alice realizes that she is there for a reason û to conquer the horrific Jabberwocky and restore the rightful queen to her throne."),
 ('Bottle Shock', '2008-08-06 00:00:00.000000', 'Based on a true story of love, victory, and fermentation', 'Paris-based wine expert Steven Spurrier heads to California in search of cheap wine that he can use for a blind taste test in the French capital. Stu ... (55 characters truncated) ...  shocked to discover a winery turning out top-notch chardonnay. Determined to make a name for himself, he sets about getting the booze back to Paris.'),
 ('The Butler', '2013-08-16 00:00:00.000000', 'One quiet voice can ignite a revolution.', "A look at the life of Cecil Gaines who served eight presidents as the White House's head butler from 1952 to 1986, and had a unique front-row seat as political and racial history was made."),
 ('Alice Through the Looking Glass', '2016-05-25 00:00:00.000000', "It's time for a little madness.", '"In the sequel to Tim Burton\'s ""Alice in Wonderland"", Alice Kingsleigh returns to Underland and faces a new adventure in saving the Mad Hatter."')]

### Question 15

Which of the statements about database normalisation are true?

**Statements:**

i) Database normalisation improves data redundancy, saves on storage space, and fulfils the requirement of records to be uniquely identified.

ii) Database normalisation supports up to the Third Normal Form and removes all data anomalies.

iii) Database normalisation removes inconsistencies that may cause the analysis of our data to be more complicated.

iv) Database normalisation increases data redundancy, saves on storage space, and fulfils the requirement of records to be uniquely identified.

**Options:**

- (i) and (ii)
- (i) and (iii) --> Corect answer
- (ii) and (iv)
- (iii) and (iv)

#

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/EAI_Blue_Dark.png"  style="width:200px";/>
</div>